Autodesk.Revit.DB.RevitLinkType.GetLinks(Autodesk.Revit.DB.Document,System.Boolean,System.Boolean)
Returns the element ids of the RvtLinkSymbols corresponding to the top-level links,
i.e. those that would be listed in the Manage Links dialog.
includeTopLevelRevitLinks:
When true top level Revit links are included.
includeIFCLinks:
When true IFC links are included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link from disk or cloud.
The link will be loaded from the input path.
Provide OpenOptions parameter
Remarks:
The input path must be absolute. Revit will store
an absolute or relative path internally, according
to the link's settings. Revit Server paths or cloud paths are acceptable.
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input path
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
path:
A ModelPath indicating where to load the link from.
This may be a path of local disk, Revit Server or Cloud.
This must be an absolute path for local path.
openOptions:
Options for opening the file.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input path "path" does not represent a Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
The model is not allowed to access.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
Revit cannot customize worksets for this model.
Revit cannot link a cloud model to non-cloud model.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2012

Autodesk.Revit.DB.RevitLinkType.UnloadLocally(Autodesk.Revit.DB.ISaveSharedCoordinatesCallbackForUnloadLocally)
Unloads a Revit link for the current user only.
Remarks:
This function unloads the Revit link for the current user,
instead of all users, in the workshared files.
If you want to unload the Revit link for all users, please use Autodesk.Revit.DB.RevitLinkType.Unload(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback).
This function should not be called on a Revit link:
in a document which is in an edit mode or is in family mode.
in a document which is in dynamic update.
in a document which is read only.
in a document in which there is transaction phase left open.
in a non-workshared file.
in a central model of workshared file.
which is nested.
which is unloaded locally already.
callback:
A callback indicating what to do if Revit encounters
links which have changes in shared coordinates. The saving options for
unloading locally  only could be: save the link, not save the link.
If null, Revit will not save any shared coordinates
changes to the link before unloading.
Returns:
Returns true if the attempt to unload the link locally was successful.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This functionality is not available in Revit LT.
-or-
The element "this RevitLinkType" is in non-workshared document.
-or-
The element "this RevitLinkType" is not in a local model: the model is not workshared or it is central.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is locally unloaded for current user already.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2016 Subscripton Update

Autodesk.Revit.DB.RevitLinkType.GetTopLevelLink(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference)
Returns the ElementId of the (top-level) linked model with the given
ExternalResourceReference.
Remarks:
This function will not return nested links.
Revit will not check the version when checking for
resource equality.
document:
The document to look for the linked model in.
reference:
An ExternalResourceReference indicating which linked model to return.
Returns:
The id of the link with the given ExternalResourceReference,
or InvalidElementId if
there is no top-level link at that location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.RevitLinkType.GetTopLevelLink(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ModelPath)
Returns the ElementId of the (top-level) linked model with the given path.
Remarks:
This function will not return nested links.
document:
The document to look for the linked model in.
path:
A path indicating which linked model to return.
Returns:
The id of the link with the given path, or InvalidElementId if
there is no top-level link at that path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.RevitLinkType.Unload(Autodesk.Revit.DB.ISaveSharedCoordinatesCallback)
Unloads the Revit link.
Remarks:
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
callback:
A callback indicating what to do if Revit encounters
links which have changes in shared coordinates.
If null, Revit will not save any shared coordinates
changes to the link before unloading.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
Revit could not save shared coordinates changes to the link
or one of its nested links.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot link a cloud model to non-cloud model
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link from disk or cloud.
The link will be loaded from the input path.
Remarks:
The input path must be absolute. Revit will store
an absolute or relative path internally, according
to the link's settings. Revit Server paths or cloud paths are acceptable.
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input path
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
path:
A ModelPath indicating where to load the link from.
This may be a path of local disk, Revit Server or Cloud.
This must be an absolute path for local path.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input path "path" does not represent a Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
The model is not allowed to access.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
-or-
Revit cannot link a cloud model to non-cloud model.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.LoadFrom(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.WorksetConfiguration)
Loads or reloads the Revit link.
The link will be loaded from the location given in the
input ExternalResourceReference.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
Revit does not try to validate that the input
represents the "same" document. You can load a
completely different document, which may invalidate
references to linked elements.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
resourceReference:
An external resource reference describing the source of the linked Revit document.
config:
A WorksetConfiguration object indicating which worksets in the
link to open.
If you want to load the same set of worksets the link previously
had, leave this argument as null.
Returns:
An object containing the ElementId of the link
and an enum value indicating any errors
which occurred while trying to load.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support Revit links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The function is not permitted during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
-or-
The document is read-only. It cannot be modified.
-or-
The document is in an edit mode or is in family mode.
-or-
Revit cannot customize worksets for this model.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.IsLoaded(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether the link with this id is loaded.
Remarks:
Returns false if typeId is not the id of a RevitLinkType.
document:
A document. Revit will see if typeId corresponds to a loaded link in this document.
typeId:
An element id. Revit will check if typeId corresponds to a loaded link in the given document.
Returns:
True if typeId corresponds to a loaded RevitLinkType. False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.RevitLinkType.RevertLocalUnloadStatus
Restores the workshared load status of a link that has been unloaded only for the current user,
in a local copy of a workshared model.
Remarks:
This function removes the local user's override of the link's workshared load status
(see UnloadLocally method).  That is, if the link is loaded in the central model for
all worksharing users (and thus has been only unloaded for the local user), then this
method will perform a full reload of the link for the local user.  If the link is
unloaded in the central model, then this method will simply clear the local user's
unload override, so that the link will be reloaded in the local user's model,
if it is ever reloaded in the central model.
This function should not be called on a Revit link:
in a document which is in an edit mode or is in family mode.
in a document which is in dynamic update.
in a document which is read only.
in a document in which there is transaction phase left open.
in a non-workshared file.
in a central model of workshared file.
which is nested.
which are not locally unloaded.
If the link is an external resource, Revit will contact the IExternalResourceServer
to get the latest version of the link.
Returns:
The link's LinkedFileStatus that has resulted from reverting the local unloaded status.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This functionality is not available in Revit LT.
-or-
The element "this RevitLinkType" is in non-workshared document.
-or-
The element "this RevitLinkType" is not in a local model: the model is not workshared or it is central.
-or-
This RevitLinkType is not a top-level link.
-or-
The link is not locally unloaded.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2016 Subscription Update

Autodesk.Revit.DB.RevitLinkType.Reload
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
This function is identical to RevitLinkType.Load() and is included for
convenience.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
LinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Load
Loads or reloads the Revit link from its
currently-stored location. If the link is an
external resource, Revit will contact the
IExternalResourceServer to get the latest version
of the link.
Remarks:
If the link is currently loaded, Revit must unload
the link before reloading it. Any changes made in-memory
to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command.
As a result, this command and others executed before it cannot be undone.
All transaction phases (e.g. transactions transaction groups and sub-transaction)
that were explicitly started must be finished prior to calling this method.
Returns:
An object containing the ElementId of the link
and an enum value indicating any
errors which occurred while trying to load.
LinkLoadResultType.LinkLoaded indicates
success.
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
The element "this RevitLinkType" is in a ducument which is in dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The element "this RevitLinkType" is in a family document or a document in in-place edit mode.
-or-
The element "this RevitLinkType" is in a document which is in an edit mode or is in family mode.
-or-
The element "this RevitLinkType" is in a read-only document.
-or-
This RevitLinkType is not a top-level link.
-or-
The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded.
-or-
The element "this RevitLinkType" is in a closed workset.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group)
at the time of invoking this method.
Since:
2014

Autodesk.Revit.DB.RevitLinkType.UpdateFromIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference,System.String,System.Boolean)
Updates a Revit link type from an IFC file and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
Note that the IFC file will not be stored directly in the document; it will
instead by stored in an intermediate Revit document, whose location is given
by revitLinkedFilePath.
document:
The document that contains Revit link.
resourceReference:
An external resource reference describing the source of the IFC file used in creation.
revitLinkedFilePath:
The path of the Revit file to create to hold the IFC information. This must be a full path.
recreateLink:
If true, the Revit file will be updated based on the information in the IFC file.  If false, the existing Revit file will be used.
Returns:
Returns true if the update succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support IFC links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is not allowed to access.
-or-
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.RevitLinkType.UpdateFromIFC(Autodesk.Revit.DB.Document,System.String,System.String,System.Boolean)
Updates a Revit link type from an IFC file and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
Note that the IFC file will not be stored directly in the document; it will
instead by stored in an intermediate Revit document, whose location is given
by revitLinkedFilePath.
document:
The document that contains Revit link.
ifcFilePath:
The path of the IFC link to load. This must be a full path.
revitLinkedFilePath:
The path of the Revit file to create to hold the IFC information. This must be a full path.
recreateLink:
If true, the Revit file will be updated based on the information in the IFC file.  If false, the existing Revit file will be used.
Returns:
Returns true if the update succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input path "ifcFilePath" does not represent an IFC file.
-or-
The document is a cloud model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at ifcFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is not allowed to access.
-or-
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.CreateFromIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference,System.String,System.Boolean,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type from an existing Revit file created via import by reference
of an asscoiated IFC file.
Remarks:
This function is one of a series of steps necessary for linking an IFC file.
To understand how it is used in context, please download the IFC open source code,
and look in the Revit.IFC.Import project at Importer.ImportIFC(ImporterIFC importer),
under the IFCImportAction.Link branch.
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
document:
The document in which to create the Revit link.
resourceReference:
An external resource reference describing the source of the IFC file used in creation.
revitLinkedFilePath:
The path of the existing Revit file that contains elements created via an import by reference operation.
This must be a full path.
recreateLink:
If true, the existing Revit file created via an import by reference operation
will be updated based on the information in the IFC file.  If false, the existing Revit file will be used as-is.
options:
An options class for loading Revit links.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document already contains a linked model at path revitLinkedFilePath.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support IFC links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at revitLinkedFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is not allowed to access.
-or-
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.RevitLinkType.CreateFromIFC(Autodesk.Revit.DB.Document,System.String,System.String,System.Boolean,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type from an existing Revit file created via import by reference
of an asscoiated IFC file.
Remarks:
This function is one of a series of steps necessary for linking an IFC file.
To understand how it is used in context, please download the IFC open source code,
and look in the Revit.IFC.Import project at Importer.ImportIFC(ImporterIFC importer),
under the IFCImportAction.Link branch.
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
document:
The document in which to create the Revit link.
ifcFilePath:
The path of the associated IFC file. This must be a full path.
revitLinkedFilePath:
The path of the existing Revit file that contains elements created via an import by reference operation.
This must be a full path.
recreateLink:
If true, the existing Revit file created via an import by reference operation
will be updated based on the information in the IFC file.  If false, the existing Revit file will be used as-is.
options:
An options class for loading Revit links.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The input path "ifcFilePath" does not represent an IFC file.
-or-
document already contains a linked model at path revitLinkedFilePath.
-or-
The document is a cloud model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at ifcFilePath's location
-or-
There is not a valid Revit file at revitLinkedFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The file is not allowed to access.
-or-
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type from an external resource reference and loads the
linked document.
Remarks:
This function regenerates the input document.
Only the WorksetConfiguration information in the options argument
will be used.  The path type information will be ignored.
document:
The document in which to create the Revit link.
resourceReference:
An external resource reference describing the source of the linked Revit document.
options:
An options class for loading Revit links.  The path type information will be ignored.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support Revit links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
-or-
The link type referred to by the ExternalResourceReference "resourceReference" already exists
in the document. You cannot create another copy of the link type. You can create
instances with RevitLinkInstance.Create(), or reload the link using RevitLinkType.Reload().
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015

Autodesk.Revit.DB.RevitLinkType.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
document:
The document in which to create the Revit link.
path:
The path of the link to load. This may be a path of local disk, Revit Server or Cloud.
This must be a full path.
options:
An options class for loading Revit links.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
Server paths cannot be relative.
-or-
document already contains a linked model at path path.
-or-
The path to be linked in is empty.
-or-
The input path "path" does not represent a Revit model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The path to be linked in doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The model is not allowed to access.
-or-
Revit cannot customize worksets for this model.
-or-
Revit cannot link a cloud model to non-cloud model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that failed on service side.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified cloud model.
Since:
2013